Revit 2027 API
AreaBasedLoadData.AddElectricalLoadArea Method
 Adds electrical load area into the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddElectricalLoadArea(
	ElementId electricalLoadAreaId
)
Public Sub AddElectricalLoadArea (
	electricalLoadAreaId As ElementId
)
public:
void AddElectricalLoadArea(
	ElementId^ electricalLoadAreaId
)
member AddElectricalLoadArea :
        electricalLoadAreaId : ElementId -> unit
Parameters
electricalLoadAreaId ElementId
 The electrical load area id to add.
Exceptions
Exception | Condition
ArgumentException |  The id isn't a valid electrical load area.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace